/*********************************************************************
 * 版权所有   magic_Zzz
 *
 * 文件名称： UserData.h 用户数据存储实体
 * 内容摘要： 用户数据存储实体
 * 其它说明： 头文件
 * 作 成 者： ZGD
 * 完成日期： 2016年03月08日
 * 修改记录1：
 * 修改日期：
 * 修 改 人：
 * 修改内容：
 * 修改记录2：
 **********************************************************************/

/***************************************************************************   *
 *   文件引用
 ***************************************************************************/
#import <Foundation/Foundation.h>

/***************************************************************************   *
 *   类引用
 ***************************************************************************/

/***************************************************************************   *
 *   宏定义
 ***************************************************************************/

/***************************************************************************   *
 *   常量
 ***************************************************************************/

/***************************************************************************   *
 *   类型定义
 ***************************************************************************/

/***************************************************************************   *
 *   类定义
 ***************************************************************************/
@interface UserData : NSObject


/***********************************************************************
* 方法名称： +(UserData *)getUserData
* 功能描述： 获取静态的用户信息
* 输入参数：
* 输出参数：
* 返 回 值：
***********************************************************************/
+ (UserData *)getUserData;

/***********************************************************************
 * 方法名称：- (void)signOutUser
 * 功能描述： 重置
 * 输入参数：
 * 输出参数：
 * 返 回 值：
 ***********************************************************************/
- (void)signOutUser;

/***********************************************************************
* 方法名称： - (void)initUserData:(NSDictionary *)userDict
* 功能描述： 登录时初始化Data
* 输入参数：
* 输出参数：
* 返 回 值：
***********************************************************************/
- (void)initUserData:(NSDictionary *)userDict;

//
@property (nonatomic, strong) NSString  *uid;// 用户id
@property (nonatomic, strong) NSString  *face;
@property (nonatomic, strong) NSString  *groupid;            // 用户ID
@property (nonatomic, strong) NSString  *username;
@property (nonatomic, strong) NSString  *type;               // 权限
@property (nonatomic, strong) NSString  *nickname;             // 昵称
@property (nonatomic, strong) NSString  *uuid;
@property (nonatomic, strong) NSString  *realname;            // 真名
@property (nonatomic, strong) NSString  *balance;           // 金额
@property (nonatomic, strong) NSString  *qqnumber;
@property (nonatomic, strong) NSString  *phone;

@property (nonatomic, strong) NSArray   *userlist; // 联系人

// 是否登录
-(BOOL)isLogin;
 
@end
